posts/2009-10-14-burning-bibles.org
#+date: <2009-10-14>
#+filetags: religion
#+title: Burning Bibles?

Interesting [[http://www.thebigdaddyweave.com/2009/10/burning-bibles-baptist-style.html][post]] today on the big daddy weave blog about a church that will burn translations other than the King James for Halloween. They'll also be burning an eclectic collection of music and books. The list of authors considered heretical is amazingly broad.
